<body>
    <p>&#192; l&#8217;origine, les ordinateurs &#233;taient r&#233;serv&#233;s aux informaticiens, ou plut&#244;t comme cette discipline naissait &#224; peine, aux math&#233;maticiens et &#233;lectroniciens qui les cr&#233;aient. <br>En anglais un ordinateur se nomme &#8220;<strong>computer</strong>&#8221; , dont la traduction exacte est &#8220;<strong>calculateur</strong>&#8221;. <br><br>Fondamentalement les ordinateurs ne font que des calculs, ils ne savent pas manipuler autre chose que des nombres, qui plus est des nombres repr&#233;sent&#233;s sous forme binaire c&#8217;est-&#224;-dire avec des 0 et des 1. En effet, comme toutes les machines &#233;lectriques la seule information qu&#8217;ils &#8220;comprennent&#8221; est de la forme, &#8220;y&#8217;a du courant&#8221; ou &#8220;y&#8217;a pas de courant&#8221;.<br><br>Or, aujourd&#8217;hui, nous utilisons tous des ordinateurs tous les jours, non pas pour faire des calculs mais pour tout un tas d&#8217;activit&#233;s diverses et vari&#233;es qu&#8217;elles soient professionnelles, li&#233;es &#224; nos loisirs ou &#224; notre vie quotidienne. Et pourtant, ces ordinateurs ne sont toujours que des machines qui font des calculs. Il a donc fallu trouver des techniques pour traduire/coder le texte, le son, les images avec des nombres. C&#8217;est ce qu&#8217;on appelle la <strong>num&#233;risation</strong>. On dit souvent que notre monde est <strong>analogique</strong> (ou continu) et que le monde des machines est <strong>num&#233;rique</strong> (ou <strong>digital</strong>). Les scanners, appareils photo num&#233;riques, enregistreurs mp3 par exemple sont des dispositifs qui permettent de passer du monde analogique des hommes au monde num&#233;rique des machines, c&#8217;est-&#224;-dire de num&#233;riser les informations sous forme de nombres que les ordinateurs vont pouvoir manipuler.<br><br>Nous vivons dans un monde o&#249; le num&#233;rique a pris beaucoup de place :&#160; internet, la radio, la t&#233;l&#233;vision, la t&#233;l&#233;phonie, la photographie et bien d&#8217;autres choses que nous ne soup&#231;onnons pas sont enti&#232;rement num&#233;riques et donc manipulables par des ordinateurs au sens large, par exemple, des tablettes, des smartphones, les box adsl &#8230; en fait toutes les machines qui fonctionnent avec des <strong>processeurs</strong>, (nous reviendrons sur ce terme). <br><br>Cela repr&#233;sente des <strong>enjeux de soci&#233;t&#233;</strong> tr&#232;s importants. le num&#233;rique a ouvert des possibilit&#233;s gigantesques en terme de gain de temps, de facilit&#233; de traitement, de nouvelles fonctionnalit&#233;s, d&#8217;acc&#232;s aux informations, aux archives etc. mais en m&#234;me temps de nouvelles questions sont apparues : o&#249; sont stock&#233;es les donn&#233;es, qui y a acc&#232;s, sont-elles en s&#233;curit&#233;, sommes-nous d&#233;pendants de machines, de logiciels, de soci&#233;t&#233;s commerciales.<br>Pour que ces questions ne restent pas dans les mains des informaticiens, il est n&#233;cessaire que chacun fasse l&#8217;effort de comprendre les bases, les fondements de ces technologies qui nous entourent. Le <strong>citoyen du XXI&#232;me si&#232;cle</strong> a besoin d&#8217;une v&#233;ritable <strong>culture num&#233;rique</strong> qui ne se limite pas &#224; l&#8217;utilisation de FaceBook ou d&#8217;un traitement de texte. C&#8217;est ce que nous allons d&#233;velopper dans ces cours...<br><br></p>
  </body>
