<body>
    <h3 dir="ltr">Le PC de 1981 &#224; aujourd'hui</h3>
<p dir="ltr">L'IBM-PC a fait son apparition en <strong>1981</strong>. <strong>Plusieurs millions d'exemplaires</strong> ont &#233;t&#233; vendu &#224; travers la monde. Le premier mod&#232;le ne poss&#233;dait <strong>pas de disque dur</strong>, seulement des lecteurs de disquettes. Par la suite, d'autres mod&#232;les toujours plus puissants et sophistiqu&#233;s ont vu le jour. &#192; chaque fois les nouveaux mod&#232;les &#233;taient <strong>compatibles</strong> avec les anciens, cela signifie que les programmes qui fonctionnaient sur les anciens mod&#232;les pouvaient &#234;tre r&#233;utilis&#233;s avec les nouveaux.</p>
<p dir="ltr"><strong>IBM</strong> s'est associ&#233; avec <strong>Microsoft</strong> qui fournissait le syst&#232;me d'exploitation qui s'appelait alors <strong>MS-DOS</strong>. Celui-ci a &#233;volu&#233; en m&#234;me temps que les capacit&#233; des machines. La derni&#232;re g&#233;n&#233;ration connue s'appelle ... <strong>Windows 8</strong> !</p>
<p dir="ltr">Gr&#226;ce&#160;&#224; son <strong>architecture ouverte</strong> (i.e. la "<strong><em>description des sch&#233;mas de fonctionnement</em></strong>" a &#233;t&#233; diffus&#233;e), de nombreuses <strong>autres marques</strong> ont fabriqu&#233; des machines comparables en respectant des <strong>normes</strong> et en installant &#233;galement les syst&#232;mes de <strong>Microsoft</strong>. On les a appel&#233; des "<strong>compatibles PC</strong>". Aujourd'hui, on a l'habitude de parler de <strong>PC</strong> et IBM n'a plus qu'une tr&#232;s petite part de ce march&#233;. En revanche <strong>Microsoft</strong> reste h&#233;g&#233;monique pour le syst&#232;me d'exploitation <strong>Windows</strong>.&#160;</p>
<p dir="ltr">Il faut n&#233;anmoins savoir que d'<strong>autres syst&#232;mes</strong> peuvent &#234;tre install&#233;s sur les PC, en particulier <strong>Linux</strong>, qui est un syst&#232;me d'exploitation rapide, fiable et puissant qui est par certains aspects<strong> bien meilleur que Windows</strong>. Malheureusement, les <strong>accords commerciaux</strong> entre les constructeurs de machines et Microsoft rendent assez <strong>compliqu&#233;s</strong> l'achat d'un PC &#233;quip&#233; de Linux. En pratique, un PC &#233;quip&#233; de Linux &#224; la place de Windows est <strong>quasi introuvable</strong> dans le commerce grand public.</p>
<p dir="ltr">Pour l'anecdote, le texte que vous &#234;tes en train de lire a &#233;t&#233; r&#233;dig&#233; sur un PC sous Linux.</p>
<h3 dir="ltr">Qui l&#8217;eut cru ?</h3>
<p dir="ltr">En 1984 sort la troisi&#232;me g&#233;n&#233;ration de PC : le <strong>PC/AT</strong></p>
<p dir="ltr"><em><strong>extrait de wikipedia</strong></em> : http://fr.wikipedia.org/wiki/IBM_PC</p>
<p>&#8220; La machine fut jug&#233;e suffisamment puissante &#8212; selon les crit&#232;res de l'&#233;poque &#8212; pour &#234;tre interdite &#224; l'exportation vers les pays de l'Est, alors sous embargo technologique (COCOM). IBM en refusa aussi pendant deux ans la vente &#224; prix r&#233;duit au personnel, arguant qu'un particulier ne pouvait pas avoir besoin d'une telle puissance ni d'une telle capacit&#233; disque (30 Mo), qui la destinaient plut&#244;t aux petites et moyennes entreprises. &#8220;</p>
<p></p>
  </body>
