<body>
    <p>Les premiers ordinateurs ont &#233;t&#233; con&#231;us et r&#233;alis&#233;s <strong>vers la fin de la seconde guerre mondiale</strong>. Il &#233;tait d&#233;j&#224; possible de leur faire r&#233;aliser des calculs complexes inaccessibles &#224; la main. Ils sont alors capables de manipuler des informations&#160; repr&#233;sent&#233;es sous une forme num&#233;rique. Gr&#226;ce &#224; la num&#233;risation de textes, d&#8217;images,&#160; de sons etc, les ordinateurs sont devenus des machines de <strong>traitement automatique de l&#8217;information</strong>. En fran&#231;ais, le mot ordinateur s&#8217;est impos&#233; en 1956. <br><br>Les premi&#232;res machines sont r&#233;alis&#233;es avec des composants rudimentaires comme des <strong>relais &#233;lectriques</strong> et des <strong>lampes &#224; vide</strong>. Ceux-ci seront par la suite remplac&#233;s par des <strong>transistors</strong>. Elles sont tr&#232;s volumineuses et lourdes, consomment &#233;norm&#233;ment d&#8217;&#233;nergie. <br><br>Mais surtout, leur utilisation est complexe car il est n&#233;cessaire d&#8217;&#233;crire les programmes qu&#8217;elles ex&#233;cutent&#160; dans un langage tr&#232;s technique propre &#224; chacune d&#8217;elles : un langage machine. De ce fait, leur diffusion et leur commercialisation sont tr&#232;s limit&#233;es. Deux inventions majeures vont lever ces difficult&#233;s :&#160; les langages informatiques et la miniaturisation. C&#8217;est &#224; la fin des ann&#233;es 50 que les premiers langages informatiques de programmation apparaissent. Ce sont des langages artificiels, c'est-&#224;-dire invent&#233;s par l'homme, facilement lisibles et intelligibles. <br><br>Un programme sp&#233;cifique appel&#233; &#8220;compilateur&#8221; ou &#8220;interpr&#232;te&#8221; se charge de traduire un texte &#233;crit dans ce langage de programmation en langage machine. Les cons&#233;quences sont importantes : la programmation devient accessible &#224; un plus grand nombre d'individus, et l'&#233;criture d'un programme n'est plus sp&#233;cifique &#224; une machine. C'est le d&#233;but du m&#233;tier de programmeur. <br><br>Le changement d'ordinateur pour une autre version plus rapide ou plus puissante est facilit&#233; et moins co&#251;teux car les programmes ne doivent pas &#234;tre r&#233;&#233;crits. <br><br>La deuxi&#232;me &#233;volution majeure, la miniaturisation, se d&#233;roule au d&#233;but des ann&#233;es 70. Elle est r&#233;alis&#233;e par l'int&#233;gration des transistors et de tous les composants &#233;lectroniques r&#233;alisant les calculs dans un ordinateur, dans un seul petit bo&#238;tier appel&#233; microprocesseur. C'est Intel, entreprise fond&#233;e entre autres par Gordon Moore qui r&#233;alise cette performance technologique. Aujourd&#8217;hui des bo&#238;tiers de quelques millim&#232;tres peuvent contenir <strong>plusieurs milliards de transistors</strong>. La <strong>miniaturisation</strong> permet l&#8217;augmentation des performances et la baisse de la consommation d&#8217;&#233;nergie. <br><br>Gordon Moore est &#233;galement connu pour avoir &#233;nonc&#233; une pr&#233;diction sur ce processus de miniaturisation. &#8220;Le nombre de transistors int&#233;gr&#233;s dans les&#160; microprocesseurs doublera tous les 2 ans&#8221;. Cette affirmation connue sous &#8220;<strong>la loi de Moore</strong>&#8221; se v&#233;rifie depuis plus de 40 ans. On l&#8217;interpr&#232;te dans le grand public comme &#8220;la puissance des ordinateurs double tous les 2 ans&#8221;. <br>Ce qui signifie en pratique que lorsque vous achetez un ordinateur, moins de 2 ans apr&#232;s vous pouvez trouver un autre mod&#232;le 2 x plus puissant au m&#234;me prix.</p>
  </body>
