<body>
    <p dir="ltr"><span>L'<strong>acc&#232;s</strong> &#224; Internet <span>a consid&#233;rablement &#233;volu&#233; </span>en quelques ann&#233;es. N&#233;anmoins, de grandes <strong>in&#233;galit&#233;s</strong> persistent encore.<br></span></p>
<p dir="ltr"></p>
<p dir="ltr"><span>Le nombre d'ordinateurs connect&#233;s permet de faire une approximation du nombre de personnes qui utilisent internet.</span></p>
<p dir="ltr"><span>Il y avait <strong>1000</strong> machines connect&#233;es en <strong>1984</strong>, 3 ans plus tard 10 fois plus, c'est &#224; dire <strong>10 000 en 1987</strong>. Cela a encore &#233;t&#233; multipli&#233; par 10 dans les 2 ann&#233;es qui suivirent, soit <strong>100 000 machines en 1989</strong>. Puis le <strong>million</strong> d'utilisateurs a &#233;t&#233; franchi en <strong>1992</strong>.</span></p>
<p dir="ltr"><span>22 ans plus tard, nous en sommes &#224; presque <strong>3 milliards</strong> d'utilisateurs &#224; travers le monde.</span></p>
<p dir="ltr"><span>Il n'existe certainement <strong>rien</strong> d'autre &#224; travers l'histoire qui ait connu une telle &#233;volution !</span></p>
<p><br>Et pourtant, la population mondiale est sup&#233;rieure &#224; 7 Milliards, ce qui nous permet de nous rendre compte que<strong> plus de la moiti&#233; de la population</strong> mondiale n'a toujours<strong> pas acc&#232;s &#224; internet</strong> !</p>
<p>En France en 2014, <strong>83%</strong> de la population est connect&#233;e, un taux <strong>sup&#233;rieur</strong> &#224; la moyenne europ&#233;enne et sup&#233;rieur aussi &#224; celui des &#201;tats-unis.</p>
<p dir="ltr">Enfin, pour tenter de <strong>mesurer</strong> l'ampleur des informations &#233;chang&#233;es sur internet, regardons ce qui ce passe en moyenne<strong> chaque minute</strong> :<span></span></p>
<ul><li dir="ltr"><span>4 millions de recherches Google</span><span></span></li>
<li dir="ltr"><span>200 millions de mails envoy&#233;s</span><span dir="ltr">&#160;</span></li>
<li dir="ltr"><span dir="ltr"></span><span>2,46 millions de contenus partag&#233;s sur Facebook</span></li>
</ul><h3 dir="ltr"><a href="https://ged.univ-lille3.fr/nuxeo/site/dav/EspacePublicWWW/%24@COURSEVIEWBYID*3966@%24#section-4"><span>Retour au cours</span></a></h3>
  </body>
