<body>
    <h3 dir="ltr">Les serveur racines de DNS</h3>
<p dir="ltr"></p>
<p dir="ltr"><span>Si les <strong>serveurs racines</strong> de DNS s'arr&#234;taient, alors progressivement les millions de serveurs de noms r&#233;partis sur la plan&#232;te qui en d&#233;pendent deviendraient obsol&#232;tes et la correspondance entre les noms des machines, que nous utilisons et les adresses IP<strong> ne fonctionnerait plus</strong>. En d'autres termes internet s'arr&#234;terait.<br></span></p>
<p dir="ltr"></p>
<p dir="ltr"><span>Or, il n'existe que <strong>13 serveurs racines</strong>, ils sont d&#233;tenus (s&#233;curis&#233;s et entretenus) par des <strong>&#233;tats</strong>, des <strong>soci&#233;t&#233;s commerciales priv&#233;es</strong> ou des <strong>organisations</strong>. Les machines qui h&#233;bergent ces serveurs sont majoritairement situ&#233;es<strong> sur le sol am&#233;ricain</strong> et donc soumis au <strong>droit am&#233;ricain</strong>, alors que l'ensemble de la plan&#232;te en d&#233;pend.<br></span></p>
<p dir="ltr"><span>&#160;</span></p>
<p dir="ltr"><span>Beaucoup de gens pensent que cela constitue un <strong>probl&#232;me</strong>, un <strong>bien commun universel</strong> aux mains de quelques-uns, soumis aux lois d'<strong>un seul pays</strong>, peut-on, doit-on faire <strong>confiance</strong> &#224; des soci&#233;t&#233;s priv&#233;es pour prendre les d&#233;cisions qui concernent la gestion, la s&#233;curit&#233; et le bon fonctionnement d'&#233;l&#233;ments aussi cruciaux que les serveurs racines de DNS. Certains militent pour une vision <strong>plus d&#233;mocratique</strong> avec des d&#233;cisions partag&#233;es.</span></p>
<p dir="ltr"><span>Vous &#234;tes maintenant en capacit&#233; de <strong>comprendre</strong> ces questions pour vous forger <strong>votre propre opinion</strong>. </span></p>
<p dir="ltr"></p>
<p dir="ltr"><span>Ces serveurs racines sont des points faible du syst&#232;me, si l'un d'entre eux devient <strong>indisponible</strong>, alors c'est un 13&#232;me de la charge qui qui doit &#234;tre r&#233;parti sur les douze autres. Vu le nombre gigantesque de requ&#234;tes effectu&#233;es en permanence, cela peut <strong>ralentir</strong> l'ensemble du r&#233;seau &#224; l'&#233;chelle de la plan&#232;te.</span></p>
<p dir="ltr"></p>
<p dir="ltr"><span>C'est ce qui s'est pass&#233; en <strong>2002</strong> et en <strong>2007</strong>, lorsque des serveurs racines ont &#233;t&#233; la cible de<strong> cyber attaques</strong>.</span></p>
<p dir="ltr"><span> cf</span><span> </span><a target="_blank" href="http://fr.wikipedia.org/wiki/Serveur_racine_du_DNS#Attaque_de_2002"><span>http://fr.wikipedia.org/wiki/Serveur_racine_du_DNS#Attaque_de_2002.</span></a><span> </span></p>
<p dir="ltr"></p>
<h3 dir="ltr"><br><a href="https://ged.univ-lille3.fr/nuxeo/site/dav/EspacePublicWWW/%24@COURSEVIEWBYID*3966@%24#section-5"><span>Retour au cours</span></a></h3>
  </body>
