<body>
    <p>Regardons un peu plus pr&#233;cis&#233;ment comment fonctionne internet. Trois ingr&#233;dients importants interviennent dans le syst&#232;me ; <strong>le premier est l&#8217;adresse IP qui permet de fournir un nom et une adresse &#224; chaque machine</strong>.<br>Chaque ordinateur connect&#233; &#224; internet a un num&#233;ro unique (un peu comme un num&#233;ro de t&#233;l&#233;phone, mais bien plus long!). Ce num&#233;ro d&#233;pend de l&#8217;endroit o&#249; l&#8217;ordinateur se trouve dans internet et permet donc de trouver un chemin dans l&#8217;interconnexion de r&#233;seaux. On appelle ce num&#233;ro l&#8217;adresse IP. De fa&#231;on tr&#232;s simplifi&#233;e, l&#8217;adresse IP comporte une partie identifiant un r&#233;seau dans cette interconnexion et une autre partie identifiant la machine au sein de ce r&#233;seau.<br><br>Pour &#233;changer des informations d&#8217;un ordinateur vers un autre, celui qui &#8220;envoie&#8221; l&#8217;information doit donc conna&#238;tre l&#8217;adresse IP du destinataire, et pour obtenir une r&#233;ponse, l&#8217;&#233;metteur doit imp&#233;rativement fournir dans chaque message envoy&#233; sa propre adresse IP. Tous les messages &#233;chang&#233;s sur Internet sont donc de la forme :<br><strong>n&#176;IP destinataire / information / n&#176;IP &#233;metteur</strong><br><br><strong>Le deuxi&#232;me ingr&#233;dient concerne le &#8220;Routage&#8221; des messages sur le r&#233;seau</strong>.<br>Si les ordinateurs &#233;metteur et destinataire sont dans le m&#234;me r&#233;seau, le principe est simple : l&#8217;ordinateur &#233;metteur envoie son message sur ce r&#233;seau et chaque ordinateur du r&#233;seau le lit. Les destinataires peuvent alors s&#8217;int&#233;resser aux messages qui leurs sont destin&#233;s.<br>Si le destinataire n&#8217;est pas dans le m&#234;me r&#233;seau, la transmission ne peut plus se faire directement &#224; l&#8217;ordinateur du destinataire. L&#8217;&#233;metteur envoie le message &#224; une machine connect&#233;e &#224; la fois &#224; ce r&#233;seau et &#224; un ou plusieurs autres r&#233;seaux. Cette machine est une <strong>passerelle/routeur</strong> qui r&#233;alise effectivement l&#8217;interconnexion. Le routeur renvoie alors le message vers les autres r&#233;seaux pour poursuivre son chemin. Et ce processus se r&#233;p&#232;te jusqu&#8217;&#224; ce que le message arrive &#224; destination.<br><br><br><strong>Enfin le troisi&#232;me ingr&#233;dient concerne le nommage des machines</strong>.<br>En effet, ce sont des femmes et des hommes qui utilisent ces machines. Pour d&#233;signer un destinataire, personne ne manipule directement des adresses IP qui sont des num&#233;ros bien plus longs que les num&#233;ros de t&#233;l&#233;phone. Dans notre interface avec le monde d&#8217;internet nous connaissons plut&#244;t des noms comme <a target="_blank" href="https://www.univ-lille3.fr/">www.univ-lille3.fr</a> ou encore <a target="_blank" href="http://www.service-public.fr/">www.service-public.fr</a>. Le lien entre adresses IP et noms se fait par le biais des &#8220;<strong>serveurs de noms</strong>&#8221; qui, &#224; la mani&#232;re d&#8217;une liste de contacts dans notre t&#233;l&#233;phone, stockent un ensemble de nom et d&#8217;adresses IP.<br><br>Tr&#232;s concr&#232;tement, regardons par exemple ce qui se passe lorsque je veux consulter la page d&#8217;accueil de Lille 3. <br>tout d&#8217;abord, je clique sur un lien vers le site de l&#8217;universit&#233;. Ce lien contient le nom de la machine capable de me fournir la page d&#8217;accueil : www.univ-lille3.fr. Mon ordinateur va donc contacter un serveur de noms pour conna&#238;tre l&#8217;adresse IP de cette machine. Une fois que cette adresse IP est connue, il peut communiquer avec www.univ-lille3.fr et envoyer &#224; cette machine un message qui demande le contenu de cette page d&#8217;accueil. Le message contient bien entendu l&#8217;adresse IP de mon ordinateur, ainsi la machine peut me r&#233;pondre en renvoyant le contenu qui m&#8217;int&#233;resse. Il ne reste plus alors &#224; mon ordinateur qu&#8217;&#224; afficher ce contenu.<br><br></p>
  </body>
