<body>
    <h2 dir="ltr">Votre propre IP</h2>
<p></p>
<p dir="ltr">Gr&#226;ce &#224; <span>http://www.monip.fr </span>vous avez trouv&#233; votre <strong>adresse IP</strong>, elle est &#233;videmment diff&#233;rente pour chacun d'entre nous.</p>
<p dir="ltr">Si vous recommencez depuis une autre machine ou avec la m&#234;me machine connect&#233;e diff&#233;remment (wifi domicile ou wifi eduroam, connexion filaire &#224; l'universit&#233; ou eduroam universit&#233;, connexion wifi ou connexion 3G/4G) vous obtiendrez &#224; chaque fois un r&#233;sultat diff&#233;rent.<span><br></span></p>
<p dir="ltr"></p>
<p dir="ltr">Pour ce qui est de la <strong>localisation</strong>, vous avez s&#251;rement obtenu une adresse <strong>g&#233;ographiquement proche</strong> de la votre, celle-ci est en fait l'<strong>adresse du&#160; routeur du fournisseur d'acc&#232;s</strong> du r&#233;seau auquel vous &#234;tes connect&#233;.</p>
<p dir="ltr"></p>
<p dir="ltr">Vous pouvez &#233;galement constater que vos<strong> informations personnelles</strong> telles que :</p>
<ul><li dir="ltr">le navigateur que vous utilisez,</li>
<li dir="ltr">la langue utilis&#233;e,</li>
<li dir="ltr">la taille de votre &#233;cran, ... ont &#233;t&#233; rep&#233;r&#233;s par le site <em>www.monip.fr</em> et vous sont renvoy&#233;s dans la liste des informations.</li>
</ul><p><br><br></p>
<h2 dir="ltr">Wikipedia, facebook et google</h2>
<p></p>
<p dir="ltr">Vous avez du trouver que la localisation de <strong>wikipedia</strong> est <strong>aux pays-Bas, pr&#232;s d'Amsterdam.</strong> C'est en effet l&#224; que se trouve la copie la plus proche.<strong><br></strong></p>
<p dir="ltr"><strong>D'autres r&#233;pliques</strong> de la c&#233;l&#232;bre encyclop&#233;die existent &#233;galement en <strong>Floride</strong> et en <strong>Cor&#233;e du&#160; Sud</strong>.</p>
<p dir="ltr"><strong>Facebook</strong> est h&#233;berg&#233; &#224; <strong>Kensington</strong>, dans l'<strong>Ohio</strong> aux<strong> &#201;tats-Unis</strong>, c'est l&#224; que les donn&#233;es de tous les utilisateurs sont stock&#233;es. <br>Alors que <strong>Google</strong> se trouve &#224; <strong>Mountain View </strong>en<strong> Californie</strong>.</p>
<p dir="ltr">Toutes les <strong>lois</strong> concernant la <strong>s&#233;curisation</strong> de nos donn&#233;es et les respect de <strong>notre vie priv&#233;e</strong> pour ces 2 sites sont donc des lois <strong>am&#233;ricaines.</strong></p>
<p></p>
<h2 dir="ltr">www.monip.fr</h2>
<p dir="ltr">et oui, ce site est une version traduite en fran&#231;ais d'un site Allemand.</p>
<p><br><br></p>
<h2 dir="ltr">www.grappa.univ-lille3.fr</h2>
<p dir="ltr">l'adresse <strong>IP</strong> de l'&#233;quipe de recherche Grappa est : <strong>194.254.132.190</strong></p>
<p><br><br></p>
<p dir="ltr">Si vous copiez cette adresse dans dans la barre d&#8217;adresse de votre navigateur, vous tombez exactement sur la <strong>m&#234;me page</strong> que si vous allez sur <a target="_blank" href="http://www.grappa.univ-lille3.fr">www.grappa.univ-lille3.fr</a>. <br>Cela ne doit pas vous surprendre si vous avez compris l'objet de cette s&#233;quence.</p>
<h6><a href="https://ged.univ-lille3.fr/nuxeo/site/dav/EspacePublicWWW/%24@COURSEVIEWBYID*3966@%24#section-6"><span>Retour au cours</span></a></h6>
  </body>
