<body>
    <p>Examinons les cons&#233;quences de l&#8217;organisation d&#8217;Internet lorsqu&#8217;on veut s&#8217;y connecter ...<br><br><strong>Rejoindre un r&#233;seau local</strong><br>L&#8217;ordinateur, le smartphone ou la tablette qui doit acc&#233;der &#224; Internet doit d&#8217;abord rejoindre un r&#233;seau. Nous verrons un peu plus loin les diff&#233;rents moyens de se connecter &#224; un r&#233;seau que ce soit par le wifi, un c&#226;ble ou le r&#233;seau de t&#233;l&#233;phonie mobile.<br><br><strong>Obtenir les 3 informations n&#233;cessaires</strong><br>De plus, nous avons vu que pour communiquer avec d&#8217;autres machines, notre ordinateur a besoin de trois informations importantes : le num&#233;ro IP, l&#8217;adresse du routeur qui relie ce r&#233;seau &#224; Internet, et l&#8217;adresse du serveur de noms. Ces trois informations sont fournies &#224; notre machine imm&#233;diatement apr&#232;s qu&#8217;elle ait rejoint le r&#233;seau. C&#8217;est une machine particuli&#232;re dans le r&#233;seau local qui fournit ces informations et donc une autorit&#233; locale qui d&#233;cide de ces attributions. Par exemple chez vous, c&#8217;est votre box ADSL sous votre responsabilit&#233; qui s&#8217;en charge. La box elle-m&#234;me, qui est un ordinateur presque comme les autres, re&#231;oit ces 3 informations de votre fournisseur d&#8217;acc&#232;s &#224; Internet (FAI) quand elle d&#233;marre. Avec la 4G c&#8217;est une machine chez votre op&#233;rateur mobile qui est sollicit&#233;e&#8230; <br><br><strong>Pas de garantie de confidentialit&#233;</strong><br>Autre remarque importante, le principe d&#8217;internet repose sur un envoi de proche en proche des messages transmis entre &#233;metteur et destinataire &#224; travers les ordinateurs (routeurs) qui r&#233;alisent l&#8217;interconnexion. Dans ce mode de fonctionnement, il n&#8217;y a de garantie ni de la confidentialit&#233; ni de l&#8217;int&#233;grit&#233; des messages. Chaque ordinateur participant &#224; la transmission peut lire et modifier les donn&#233;es &#233;chang&#233;es. Si l&#8217;on veut transmettre des donn&#233;es sensibles, il faut donc mettre en &#339;uvre des proc&#233;dures sp&#233;cifiques additionnelles pour assurer l&#8217;authenticit&#233; et/ou la confidentialit&#233; des donn&#233;es transmises. Par exemple,&#160; pour transmettre des mots de passe ou des num&#233;ros de carte bleue, il est n&#233;cessaire de crypter les messages pour les rendre ind&#233;chiffrables par des curieux.<br><br><strong>Filtrage et suivi possible</strong><br>Une autre cons&#233;quence du fonctionnement d&#8217;internet, est que des filtres peuvent &#234;tre mis en place sur des routeurs pour emp&#234;cher certains messages d&#8217;&#234;tre transmis. Ces filtres peuvent se limiter &#224; contr&#244;ler les adresses des destinataires pour emp&#234;cher de contacter certaines machines. Ils ont par exemple &#233;t&#233; mis en &#339;uvre dans des pays voulant s&#8217;isoler ou censurer quelques services comme twitter, ou encore wikileaks...&#160; Les filtres peuvent &#233;galement concerner les contenus des messages comme dans le cas des filtres parentaux sur les box ADSL (qui incluent une fonction de routeur). Les entreprises et organisations emploient aussi cette possibilit&#233; pour garder les traces des connexions et r&#233;pondre ainsi &#224; la contrainte l&#233;gale de pouvoir retrouver les protagonistes d&#8217;un &#233;change illicite.<br>&#160;<br><strong>Impossibilit&#233; d&#8217;&#233;viter la copie</strong><br>La derni&#232;re remarque porte sur l&#8217;emploi trompeur du mot &#8220;envoi&#8221;. Lorsqu&#8217;une machine &#8220;envoie&#8221; un message, elle r&#233;alise en r&#233;alit&#233; une copie du message sur le r&#233;seau. Libre alors &#224; elle de supprimer ou conserver la version originelle du message. C&#8217;est une situation que l&#8217;on rencontre r&#233;guli&#232;rement dans le monde &#8220;num&#233;rique&#8221; et qui rend difficile la lutte contre les copies illicites. Mais nous aurons l&#8217;occasion d&#8217;en reparler plus tard.<br><br>Mais finalement, pourquoi avoir con&#231;u et suivi cette organisation complexe d&#8217;interconnexion de r&#233;seaux? En fait, un tr&#232;s grand r&#233;seau o&#249; toutes les machines seraient directement reli&#233;es est impossible &#224; concevoir. Il faudrait multiplier les c&#226;bles et m&#234;me dans une solution sans fil, &#224; l&#8217;image d&#8217;une discussion &#224; plusieurs personnes, au del&#224; d&#8217;une certaine limite les discussions des uns couvrent in&#233;vitablement celle des autres &#224; tel point qu&#8217;on ne peut plus discuter! Les r&#233;seaux locaux avec des discussions locales ne peuvent donc fonctionner que jusqu&#8217;&#224; une certaine taille au del&#224; de laquelle une structuration par interconnexion devient obligatoire.<br><br><br></p>
  </body>
