<body>
    <p>Internet et plus g&#233;n&#233;ralement les r&#233;seaux informatiques peuvent utiliser plusieurs types de supports pour transporter l&#8217;information num&#233;rique. On&#160; distinguera les supports physiques, les c&#226;bles qui peuvent &#234;tre &#233;lectriques ou optiques et les ondes &#233;lectromagn&#233;tiques comme le Wifi, le bluetooth ou les r&#233;seaux de t&#233;l&#233;phonie mobiles. Nous allons voir qu&#8217;une connaissance minimale de ces technologies va nous permettre de mieux comprendre les enjeux qu&#8217;ils cachent.<br><br><strong>Le d&#233;bit</strong><br>Tout d&#8217;abord nous devons introduire la notion de <strong>d&#233;bit</strong>. Si on prend l&#8217;image d&#8217;un robinet d&#8217;eau, on voit bien qu&#8217;un robinet avec un gros tuyau me permettra de remplir mon seau beaucoup plus vite qu&#8217;avec un petit robinet qui ne laisse passer qu&#8217;un l&#233;ger filet d&#8217;eau. Le d&#233;bit dans ce cas est une quantit&#233; d&#8217;eau par seconde. <br>La probl&#233;matique est la m&#234;me pour le r&#233;seau Internet. Nous avons vu pr&#233;c&#233;demment que les informations num&#233;riques &#233;taient ramen&#233;es &#224; des suites de bits (des 0 et des1). Le d&#233;bit sera donc pour les r&#233;seaux en nombre de bits par seconde. Comme cette information circule tr&#232;s vite on parlera en fait de milliers de bits par seconde (kb/s), de millions de bits par seconde (Mb/s) voire de milliards de bits par seconde (Gb/s).<br>&#192; titre indicatif, voici quelques ordres de grandeur, un document texte d&#8217;une dizaine de pages se code avec quelques kbits, un fichier mp3 de musique de quelques minutes se compte en Mbits alors qu&#8217;un film d&#8217;une heure correspond &#224; plusieurs Gbits.<br><br><strong>Les supports et les normes relatives &#224; leur utilisation</strong><br>Nous allons dans la suite pr&#233;senter les diff&#233;rents supports utilis&#233;s dans les r&#233;seaux. Ils ont connu de fortes &#233;volutions depuis les d&#233;buts d&#8217;internet. Parfois cette &#233;volution est purement mat&#233;rielle comme l&#8217;apparition de la fibre optique, d&#8217;autres fois l&#8217;&#233;volution consiste en une meilleure utilisation du support. L&#8217;utilisation du support est d&#233;crite dans un ensemble de normes comme par exemple la 3G ou la 4G qui tous deux utilisent le support des ondes. Aussi la pr&#233;sentation suivante s&#8217;appuie &#224; la fois sur les deux notions de norme et de support.<br><br><strong>Les c&#226;bles</strong><br>S&#8217;agissant des c&#226;bles on distingue les <strong>c&#226;bles &#233;lectriques</strong> et les <strong>fibres optiques</strong> qui transportent la lumi&#232;re. Ces derni&#232;res sont &#233;videmment beaucoup plus rapides et sont utilis&#233;es prioritairement quand c&#8217;est possible. C&#8217;est le cas par exemple de la plupart des <strong>c&#226;bles sous-marins</strong> qui traversent les oc&#233;ans pour relier les continents, certains ont des d&#233;bits sup&#233;rieurs &#224; 100Gb/s.<br>Des c&#226;bles &#233;lectriques sp&#233;cifiques pour les r&#233;seaux informatiques peuvent &#233;galement &#234;tre tr&#232;s rapides mais sur des <strong>courtes distances</strong>.<br>C&#8217;est en g&#233;n&#233;ral la solution retenue pour connecter les ordinateurs d&#8217;un <strong>r&#233;seau local</strong> dans les entreprises. C&#8217;est aussi le cas pour les ordinateurs &#224; votre disposition dans les salles informatiques de l&#8217;universit&#233;.<br><br>En revanche, ce n&#8217;est pas le cas de la plupart du r&#233;seau fran&#231;ais qui relie la majorit&#233; des foyers du pays. Les lignes qu&#8217;on appelle ADSL, sont en fait les c&#226;bles de l&#8217;ancien r&#233;seau t&#233;l&#233;phonique qui a &#233;t&#233; construit &#224; l&#8217;origine pour transporter la voix du t&#233;l&#233;phone et non des informations num&#233;riques &#224; tr&#232;s grande vitesse. Cela explique que les connexions dont nous disposons &#224; domicile sont de qualit&#233; moyenne et ne permettent pas le tr&#232;s haut d&#233;bit, sauf &#224; passer par une fibre optique, c&#8217;est ce que proposent d&#233;sormais beaucoup de fournisseurs d&#8217;acc&#232;s dans certains quartiers. <br><br>&#201;videmment, le c&#226;blage de toutes les zones habit&#233;es avec de la fibre optique repr&#233;sente un enjeu social et &#233;conomique consid&#233;rable. Alors que les lignes de t&#233;l&#233;phone sont pr&#233;sentes sur l&#8217;ensemble du territoire, seules les grandes agglom&#233;rations sont couvertes par l&#8217;&#233;quipement en fibres optiques. Cela repr&#233;sente un grand facteur d&#8217;in&#233;galit&#233;...<br><br><strong>Les ondes</strong><br>Depuis le XIX&#232;me si&#232;cle, les hommes ont r&#233;ussi &#224; s&#8217;&#233;changer des informations via les <strong>ondes &#233;lectromagn&#233;tiques</strong>. La radio puis la t&#233;l&#233;vision ont copieusement utilis&#233; ce principe qui utilise un <strong>syst&#232;me d&#8217;antennes</strong> &#233;mettrices et r&#233;ceptrices. Nous savons transporter de la m&#234;me fa&#231;on des informations num&#233;riques. &#192; chaque r&#233;seau son antenne, certains appareils sont &#233;quip&#233;s d&#8217;une antenne Wifi, d&#8217;une antenne Bluetooth et pour les t&#233;l&#233;phones d&#8217;une antenne de r&#233;seau de donn&#233;es mobiles. <br>Ces diff&#233;rentes technologies sont essentiellement utilis&#233;es pour nos <strong>connexions nomades</strong>, c&#8217;est-&#224;-dire avec des <strong>appareils mobiles</strong> tels que des ordinateurs portables, des tablettes ou des smartphones. Fondamentalement, elles permettent toutes la m&#234;me chose, c&#8217;est &#224; dire un<strong> acc&#232;s complet &#224; Internet</strong>.</p>
  </body>
