<body>
    <p><strong>Les connexions nomades</strong><br>On se retrouve r&#233;guli&#232;rement &#224; devoir choisir parmi plusieurs moyens pour se connecter &#224; internet avec nos appareils nomades. Les arguments qui entrent dans ce choix sont tr&#232;s vari&#233;s. On pense bien entendu au co&#251;t. Par exemple, l&#8217;utilisation du wifi de l&#8217;universit&#233; est gratuite. Les acc&#232;s internet par le biais d&#8217;une box sont g&#233;n&#233;ralement inclus dans un forfait illimit&#233;, en revanche le co&#251;t de l&#8217;utilisation d&#8217;internet &#224; l&#8217;aide de connexions 2G/3G/4G peut rapidement exploser.<br><br>Un autre &#233;l&#233;ment d&#233;terminant est la disponibilit&#233; de la connexion. En effet, selon les endroits o&#249; l&#8217;on se trouve, le r&#233;seau mobile peut &#234;tre indisponible ou de tr&#232;s faible qualit&#233;, inversement il n&#8217;y a pas toujours un acc&#232;s Wifi &#224; notre port&#233;e. Notons que si l&#8217;on se d&#233;place de plus de quelques m&#232;tres, il devient quasi-impossible de rester connect&#233; &#224; un r&#233;seau wifi qui a une port&#233;e assez faible. Les r&#233;seaux de t&#233;l&#233;phonie mobiles autorisent par contre une connexion permanente sur des longues distances &#224; pied ou en voiture par exemple.<br><br>Depuis les ann&#233;es 90, le r&#233;seau de t&#233;l&#233;phonie mobile permet le transfert de donn&#233;es num&#233;riques. <br><br>Mais les normes et les techniques &#233;voluent et sont de plus en plus rapides. Les premi&#232;res g&#233;n&#233;rations proposaient des d&#233;bits tr&#232;s faibles qui ne permettaient pas par exemple le transfert d&#8217;images ou de musique dans des temps raisonnables. Nous en sommes &#224; la quatri&#232;me g&#233;n&#233;ration de la technologie, la 4G offre maintenant des d&#233;bits qui d&#233;passent parfois ceux des connexions wifi.<br><br><strong>La rapidit&#233; du r&#233;seau</strong><br>Toutefois, la qualit&#233; du lien qui relie votre appareil &#233;lectronique au r&#233;seau n&#8217;est pas le seul responsable du d&#233;bit. R&#233;fl&#233;chissons &#224; ce qui fait que ma liaison est lente ou rapide. Tout d&#8217;abord il faut se rappeler que les d&#233;bits indiqu&#233;s par les constructeurs ou les op&#233;rateurs sont toujours th&#233;oriques et correspondent au maximum possible dans les meilleures conditions. En pratique, ces conditions sont rarement r&#233;unies et les d&#233;bits peuvent &#234;tre consid&#233;rablement ralentis en fonction de plusieurs facteurs :</p>
<ul><li>le premier facteur que l&#8217;on peut citer est l&#8217;<strong>&#233;loignement</strong>, celui-ci joue aussi bien pour les connexions par onde que pour les connexions par c&#226;ble. Par exemple, les acc&#232;s ADSL sont tr&#232;s diff&#233;rents selon qu&#8217;on a la chance d&#8217;habiter pr&#232;s d&#8217;un noeud de raccordement aux abonn&#233;s (qui contient les machines des fournisseurs d&#8217;acc&#232;s) ou si on en est plus &#233;loign&#233;, les d&#233;bits peuvent alors &#234;tre 10 ou 20 fois plus rapides, &#8230; pour le m&#234;me prix d&#8217;abonnement.<br><br>De m&#234;me, si on s&#8217;&#233;loigne au fond du jardin avec son portable, la connexion wifi &#224; notre box va consid&#233;rablement perdre en qualit&#233;, jusqu&#8217;&#224; ne plus &#234;tre accessible.</li>
</ul><ul><li>un autre facteur important est le <strong>nombre d&#8217;utilisateurs</strong> du r&#233;seau, quelle que soit la technologie utilis&#233;e, on peut voir les autoroutes de l&#8217;information comme de vraies autoroutes, lorsqu&#8217;il y a beaucoup de voitures le trafic est ralenti, de la m&#234;me fa&#231;on, si une connexion wifi par exemple est partag&#233;e par plusieurs utilisateurs, le d&#233;bit sera reparti entre eux et aucun d&#8217;entre eux n&#8217;aura acc&#232;s au d&#233;bit maximum</li>
</ul><ul><li><strong>l&#8217;encombrement</strong> du r&#233;seau est encore un autre facteur, les routeurs peuvent &#234;tre vus comme les p&#233;ages des autoroutes, ce sont des goulots d&#8217;&#233;tranglement qui bouchonnent lorsque beaucoup de demandes arrivent en m&#234;me temps</li>
</ul><ul><li>enfin, il arrive que l&#8217;actualit&#233; fasse que certains sites soient sollicit&#233;s au m&#234;me moment par des milliers ou des millions d&#8217;utilisateurs, le site ne pouvant r&#233;pondre &#224; tout le monde en m&#234;me temps, le temps de r&#233;ponse pour chacun se trouve consid&#233;rablement ralentie.</li>
</ul><p>Ainsi, il est tr&#232;s fr&#233;quent de constater que la vitesse de transmission des donn&#233;es varie dans le temps ; varie selon les endroits ou les moyens avec lesquels on se connecte &#224; Internet ou encore varie selon les sites que l&#8217;on visite ou les services que l&#8217;on demande. Comme nous venons de le voir, la vitesse d&#8217;une connexion d&#233;pend de nombreux facteurs. Difficile donc de savoir d&#8217;o&#249; vient un ralentissement quand il intervient. Mais parfois, le simple changement du mode de connexion utilis&#233; peut faire des miracles. Soyez agiles !!!</p>
  </body>
